package ru.antonsesin;

public class Example6 {
   /* Напишите программу на Java, которая создает двумерный массив NxM, наполняет его случайными значениями, после
   чего для каждого элемента массива вычисляет сумму его соседей (сверху, снизу, слева и справа) и сохраняет
    эти суммы в новом двумерном массиве того же размера.

    Требования к программе:
            1. Создайте двумерный массив целых чисел (int[][]) размером N x M. Размерность массива задается
            пользователем (запрашивается в консоли).
            2. Заполните его случайными числами от 1 до 9 (должен быть реализован метод заполнения случайными значениями).
            3. Создайте второй двумерный массив того же размера для хранения сумм соседей.
            4. Для каждого элемента вычислите сумму его соседей в ближайших соседних ячейках (по диагонали НЕ учитывать):
            • Если у элемента нет соседа сверху (первая строка), не учитывайте его.
            • Если у элемента нет соседа снизу (последняя строка), не учитывайте его.
            • Если у элемента нет соседа слева (первый столбец), не учитывайте его.
            • Если у элемента нет соседа справа (последний столбец), не учитывайте его.
            5. Запишите полученную сумму в соответствующую ячейку второго массива.
            6. Выведите оба массива (исходный и с суммами) на экран для проверки.
    Пример:
    Сгенерированный массив
        1 2 3
        4 5 6
        7 8 9
    Массив после вычисления
        6 9 8
        13 20 17
        12 21 14
*/
}
