package ru.antonsesin;

public class Example5 {
 /*   Напишите программу на Java, которая генерирует случайное целое число в диапазоне от 1 до 100 (включительно).
 Пользователь должен угадать это число. Программа должна давать пользователю подсказки "Слишком мало" или
 "Слишком много" после каждой попытки. Игра продолжается до тех пор, пока пользователь не угадает число.
  В конце игры программа должна вывести количество попыток, которые потребовались пользователю для угадывания числа.

    Требования к программе:
• Программа должна при запуске игры автоматически генерировать случайное число [1..100] и вывести
 информацию пользователю, что игра началась, число загадано.
• Каждую попытку программа должна запрашивать у пользователя ввод числа и выводить в ответ "Вы угадали",
"Слишком мало" или "Слишком много" в зависимости от сравнения.
• Программа должна продолжать запрашивать ввод, пока число не будет угадано.
• Программа должна вывести количество попыток в конце игры.*/

}
